run/general/cylinderCooling/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           volVectorField;
    location        "0";
    object          U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   nonuniform List<vector> 
5388
(
(-4.344e-09 1.57721e-07 -3.67748e-16)
(-2.99497e-08 5.01266e-07 6.40301e-16)
(-8.43579e-08 9.08893e-07 1.49702e-18)
(-1.86226e-07 1.39127e-06 3.58234e-18)
(-3.58298e-07 1.96061e-06 0)
(-6.34707e-07 2.6304e-06 -1.31026e-15)
(-1.06446e-06 3.41528e-06 1.56395e-15)
(-1.71674e-06 4.33066e-06 2.91296e-17)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ( 0.015 0 0 );
    }
    outlet
    {
        type            zeroGradient;
    }
    cylinder
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}

Uinlet          0.015;


// ************************************************************************* //
