run/general/cylinderCooling/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc forceCoeffsCompressible
#includeFunc residuals
(
    name=residuals,
    fields=(p U)
)
#includeFunc streamlinesLine
(
    name=streamlines,
    start=(0.02 -0.04 0),
    end=(0.02 0.04 0),
    nPoints=40,
    U
)
#includeFunc patchAverage
(
    name=Tmean,
    patch=cylinder,
    T
)

// ************************************************************************* //
